In [1]:
import numpy as np 
import pandas as pd

# Generated Missing Data - Part 1

In [ ]:
from numpy import NaN, NAN, nan

In [ ]:
df = pd.read_csv('Data/countries.csv')
df

In [ ]:
df = pd.read_csv('Data/countries.csv', na_values=['Not Known'])
df

In [ ]:
df = pd.read_csv('Data/countries.csv', na_filter=False)
df

In [ ]:
df = pd.read_csv('Data/countries.csv', na_values=['Not Known'], keep_default_na=False)
df

In [ ]:
df = pd.read_csv('Data/books.csv')
df

In [ ]:
df2 = df.reindex(['ID','Author','Title','Price'],axis=1)
df2

In [ ]:
df2['Price'] = [10.00, 20.00, 15.00]
df2

In [ ]:
df.shift(1)

In [ ]:
df1 = pd.read_csv('Data/books_store.csv')
df1

In [ ]:
df.reindex(['ID','Author','Title','Price'],axis=1, fill_value= 0.00)

In [ ]:
df.shift(1, fill_value='Empty')

In [ ]:
df1 = pd.read_csv('Data/books_store.csv')
df1

In [ ]:
pd.merge(df,df1, on = ['ID','Title'], how='right')

# Working with Missing Values - Part 2

In [2]:
df = pd.read_csv('Data/countries.csv')
df

  Country  Population     Capital    Area
0     USA      329.50  Washington  3796.0
1  Russia      144.10      Moscow     NaN
2  Sweden         NaN   Stockholm   450.0
3      UK       67.22   Not Known   242.0
4   Japan      125.80       Tokyo     NaN
5   Egypt      102.30   Not Known  1010.0

In [3]:
np.count_nonzero(df.isnull())

3

In [4]:
np.count_nonzero(df['Area'].isnull())

2

In [5]:
df['Area'].value_counts(dropna=False)

NaN       2
3796.0    1
450.0     1
242.0     1
1010.0    1
Name: Area, dtype: int64

In [6]:
df.dropna()

  Country  Population     Capital    Area
0     USA      329.50  Washington  3796.0
3      UK       67.22   Not Known   242.0
5   Egypt      102.30   Not Known  1010.0

In [7]:
df.fillna('Empty')

  Country Population     Capital    Area
0     USA      329.5  Washington  3796.0
1  Russia      144.1      Moscow   Empty
2  Sweden      Empty   Stockholm   450.0
3      UK      67.22   Not Known   242.0
4   Japan      125.8       Tokyo   Empty
5   Egypt      102.3   Not Known  1010.0

In [8]:
df.fillna({'Population':0.0, 'Area': 10.0})

  Country  Population     Capital    Area
0     USA      329.50  Washington  3796.0
1  Russia      144.10      Moscow    10.0
2  Sweden        0.00   Stockholm   450.0
3      UK       67.22   Not Known   242.0
4   Japan      125.80       Tokyo    10.0
5   Egypt      102.30   Not Known  1010.0

In [ ]:
df.fillna(0, inplace=True)

In [ ]:
df.fillna(method='ffill')

In [ ]:
df.fillna(method='bfill')

In [ ]:
df.fillna(df.mean())

In [ ]:
df.interpolate()

In [ ]:
pd.Series([1, 4, None, 5, 12])

In [ ]:
pd.Series([1, 4, np.nan, 5, 12])

In [ ]:
pd.Series([1, 4, 5, 12])

In [ ]:
pd.Series([1, 4, pd.NA, 5, 12])

In [ ]:
pd.Series([1, 4, pd.NA, 5, None, np.nan], dtype='Int64')

In [ ]:
pd.array([1, 4, pd.NA, 5, None, np.nan])

In [ ]:
pd.array([1.0, 4.0, pd.NA, 5.0, None, np.nan])

In [ ]:
pd.Series([True, False, None, True, False])

In [ ]:
pd.Series([True, False, np.nan, True, False])

In [ ]:
pd.Series([True, False, pd.NA, True, False])

In [ ]:
pd.Series([True, False, pd.NA, True, None, np.nan, False], dtype='boolean')

In [ ]:
pd.array([True, False, pd.NA, True, None, np.nan, False])